{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 150, 150, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 150, 150, 3], "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 150, 150, 3], "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.30000001192092896}}, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "f1_m", "dtype": "float32", "fn": "f1_m"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "precision_m", "dtype": "float32", "fn": "precision_m"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "recall_m", "dtype": "float32", "fn": "recall_m"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Addons>Lookahead", "config": {"name": "Lookahead", "optimizer": {"class_name": "Addons>RectifiedAdam", "config": {"name": "RectifiedAdam", "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "weight_decay": 0.0, "sma_threshold": 5.0, "epsilon": 1e-07, "amsgrad": false, "total_steps": 0, "warmup_proportion": 0.10000000149011612, "min_lr": 0.0}}, "sync_period": 6, "slow_step_size": 0.5}}}}, "weightsManifest": [{"paths": ["group1-shard1of174.bin", "group1-shard2of174.bin", "group1-shard3of174.bin", "group1-shard4of174.bin", "group1-shard5of174.bin", "group1-shard6of174.bin", "group1-shard7of174.bin", "group1-shard8of174.bin", "group1-shard9of174.bin", "group1-shard10of174.bin", "group1-shard11of174.bin", "group1-shard12of174.bin", "group1-shard13of174.bin", "group1-shard14of174.bin", "group1-shard15of174.bin", "group1-shard16of174.bin", "group1-shard17of174.bin", "group1-shard18of174.bin", "group1-shard19of174.bin", "group1-shard20of174.bin", "group1-shard21of174.bin", "group1-shard22of174.bin", "group1-shard23of174.bin", "group1-shard24of174.bin", "group1-shard25of174.bin", "group1-shard26of174.bin", "group1-shard27of174.bin", "group1-shard28of174.bin", "group1-shard29of174.bin", "group1-shard30of174.bin", "group1-shard31of174.bin", "group1-shard32of174.bin", "group1-shard33of174.bin", "group1-shard34of174.bin", "group1-shard35of174.bin", "group1-shard36of174.bin", "group1-shard37of174.bin", "group1-shard38of174.bin", "group1-shard39of174.bin", "group1-shard40of174.bin", "group1-shard41of174.bin", "group1-shard42of174.bin", "group1-shard43of174.bin", "group1-shard44of174.bin", "group1-shard45of174.bin", "group1-shard46of174.bin", "group1-shard47of174.bin", "group1-shard48of174.bin", "group1-shard49of174.bin", "group1-shard50of174.bin", "group1-shard51of174.bin", "group1-shard52of174.bin", "group1-shard53of174.bin", "group1-shard54of174.bin", "group1-shard55of174.bin", "group1-shard56of174.bin", "group1-shard57of174.bin", "group1-shard58of174.bin", "group1-shard59of174.bin", "group1-shard60of174.bin", "group1-shard61of174.bin", "group1-shard62of174.bin", "group1-shard63of174.bin", "group1-shard64of174.bin", "group1-shard65of174.bin", "group1-shard66of174.bin", "group1-shard67of174.bin", "group1-shard68of174.bin", "group1-shard69of174.bin", "group1-shard70of174.bin", "group1-shard71of174.bin", "group1-shard72of174.bin", "group1-shard73of174.bin", "group1-shard74of174.bin", "group1-shard75of174.bin", "group1-shard76of174.bin", "group1-shard77of174.bin", "group1-shard78of174.bin", "group1-shard79of174.bin", "group1-shard80of174.bin", "group1-shard81of174.bin", "group1-shard82of174.bin", "group1-shard83of174.bin", "group1-shard84of174.bin", "group1-shard85of174.bin", "group1-shard86of174.bin", "group1-shard87of174.bin", "group1-shard88of174.bin", "group1-shard89of174.bin", "group1-shard90of174.bin", "group1-shard91of174.bin", "group1-shard92of174.bin", "group1-shard93of174.bin", "group1-shard94of174.bin", "group1-shard95of174.bin", "group1-shard96of174.bin", "group1-shard97of174.bin", "group1-shard98of174.bin", "group1-shard99of174.bin", "group1-shard100of174.bin", "group1-shard101of174.bin", "group1-shard102of174.bin", "group1-shard103of174.bin", "group1-shard104of174.bin", "group1-shard105of174.bin", "group1-shard106of174.bin", "group1-shard107of174.bin", "group1-shard108of174.bin", "group1-shard109of174.bin", "group1-shard110of174.bin", "group1-shard111of174.bin", "group1-shard112of174.bin", "group1-shard113of174.bin", "group1-shard114of174.bin", "group1-shard115of174.bin", "group1-shard116of174.bin", "group1-shard117of174.bin", "group1-shard118of174.bin", "group1-shard119of174.bin", "group1-shard120of174.bin", "group1-shard121of174.bin", "group1-shard122of174.bin", "group1-shard123of174.bin", "group1-shard124of174.bin", "group1-shard125of174.bin", "group1-shard126of174.bin", "group1-shard127of174.bin", "group1-shard128of174.bin", "group1-shard129of174.bin", "group1-shard130of174.bin", "group1-shard131of174.bin", "group1-shard132of174.bin", "group1-shard133of174.bin", "group1-shard134of174.bin", "group1-shard135of174.bin", "group1-shard136of174.bin", "group1-shard137of174.bin", "group1-shard138of174.bin", "group1-shard139of174.bin", "group1-shard140of174.bin", "group1-shard141of174.bin", "group1-shard142of174.bin", "group1-shard143of174.bin", "group1-shard144of174.bin", "group1-shard145of174.bin", "group1-shard146of174.bin", "group1-shard147of174.bin", "group1-shard148of174.bin", "group1-shard149of174.bin", "group1-shard150of174.bin", "group1-shard151of174.bin", "group1-shard152of174.bin", "group1-shard153of174.bin", "group1-shard154of174.bin", "group1-shard155of174.bin", "group1-shard156of174.bin", "group1-shard157of174.bin", "group1-shard158of174.bin", "group1-shard159of174.bin", "group1-shard160of174.bin", "group1-shard161of174.bin", "group1-shard162of174.bin", "group1-shard163of174.bin", "group1-shard164of174.bin", "group1-shard165of174.bin", "group1-shard166of174.bin", "group1-shard167of174.bin", "group1-shard168of174.bin", "group1-shard169of174.bin", "group1-shard170of174.bin", "group1-shard171of174.bin", "group1-shard172of174.bin", "group1-shard173of174.bin", "group1-shard174of174.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [350464], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [350464], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [350464], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [350464], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d/kernel", "shape": [3, 3, 3, 512], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense/kernel", "shape": [350464, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [256, 4], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}]}]}